src/main/test/supply-chain/0-Validation/0-Apply Tax/4-01_01_05_Fill_up_rules/5-TC01.01.05.06_Fill_up_ShippingOfCustomsClearedGoods/1-TC01.01.05.06_Fill_up_ShippingOfCustomsClearedGoods_2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
       <arg0><DocumentId>
    <SystemSourceId>FRIM001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CUSTOM_01</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
    
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
    
      <SellerLocalTaxCurrencyCode/>
      
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      
      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>
      
    </TaxInvoiceLine>
    
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-02-12</TaxAlgorithmDate>
    <TaxCalculationDate>2014-02-12</TaxCalculationDate>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry>DE</ConsignorCountry>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>9000</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry>CA</ConsigneeCountry>
    <ConsigneeState>CAON</ConsigneeState>
    <ConsigneeBusinessUnitCode>3101</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry>DE</ShipmentStartCountry>
    <ShipmentEndCountry>CA</ShipmentEndCountry>
    <ShipmentStartState/>
    <ShipmentEndState>CAON</ShipmentEndState>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose/>
    <IsOutBonded/>
    <IsInBonded/>
    <TaxPreAlgorithmOutput>
      <IsExport/>
      <IsImport/>
      <IsExported/>
      <IsImported/>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>7522</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>FR</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>9000</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
       <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>DE</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery></arg0></ws:applyTax>
   </soap:Body>
</soap:Envelope>